"There was an error in processing the images." = "Er heeft zich een fout voorgedaan bij het verwerken van de afbeeldingen.";

"The MakePDF application not found on this system." = "Het programma voor het maken van pdf-bestanden is niet gevonden op deze computer.";